In [1]:
import pandas as pd

In [2]:
dict_data = {
    'c0':[1,2,3],
    'c1':[4,5,6],
    'c2':[7,8,9],
    'c3':[10,11,12]
}
dict_data

{'c0': [1, 2, 3], 'c1': [4, 5, 6], 'c2': [7, 8, 9], 'c3': [10, 11, 12]}

In [3]:
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3
0   1   4   7  10
1   2   5   8  11
2   3   6   9  12

In [6]:
# List
df = pd.DataFrame(
    [
        [15, 'Male','Ducyoung Middle School'],
        [17, 'Female','soori Middle School'],    
    ],
    index=['Junsu','YeEun'],
    columns=['Age','Gender','School']
)
df

       Age  Gender                  School
Junsu   15    Male  Ducyoung Middle School
YeEun   17  Female     soori Middle School

In [8]:
print(df.index)
print(df.columns)

Index(['Junsu', 'YeEun'], dtype='object')
Index(['Age', 'Gender', 'School'], dtype='object')

In [10]:
# Change Index studnet1,student2
df.index=['Student1','Student2']
df

          Age  Gender                  School
Student1   15    Male  Ducyoung Middle School
Student2   17  Female     soori Middle School

In [11]:
# Change Column
df.columns=['연령','성별','학교']

In [12]:
df

          연령      성별                      학교
Student1  15    Male  Ducyoung Middle School
Student2  17  Female     soori Middle School

In [13]:
# 재활용
df = pd.DataFrame(
    [
        [15, 'Male','Ducyoung Middle School'],
        [17, 'Female','soori Middle School'],    
    ],
    index=['Junsu','YeEun'],
    columns=['Age','Gender','School']
)
df

       Age  Gender                  School
Junsu   15    Male  Ducyoung Middle School
YeEun   17  Female     soori Middle School

In [17]:
df.index[1] = 'YYYY'
# 1개만 바꾸는건 안댐

TypeError: Index does not support mutable operations

# 필요한 부분만 수정하기

In [19]:
df.rename(columns={'Age':'연령'}, inplace=True) # inplace True를 해줘야 변경내용을 바로 적용시킴
df

       연령  Gender                  School
Junsu  15    Male  Ducyoung Middle School
YeEun  17  Female     soori Middle School

In [23]:
# Junsu 를 학생1로 변경하기
df.rename(index={'Junsu':'Student1'}, inplace=True)
df

          연령  Gender                  School
Student1  15    Male  Ducyoung Middle School
YeEun     17  Female     soori Middle School

In [91]:
# List를 통하여 DataFrame 을 제작 후 index와 Column 이름 변경하기
tjwns = [90, 98, 85, 100]
dngus = [80, 89, 95, 90]
dlsdk = [70, 95, 100, 90]

df = pd.DataFrame(
    [
        tjwns,dngus,dlsdk
    ]
)
df

    0   1    2    3
0  90  98   85  100
1  80  89   95   90
2  70  95  100   90

In [92]:
df.index = ['서준','우현','인아']
df.columns = ['Math','Eng','Music',' P.E']

In [93]:
df

    Math  Eng  Music   P.E
서준    90   98     85   100
우현    80   89     95    90
인아    70   95    100    90

In [32]:
data = {
    '서준': [80,98,85,100],
    '우현':[].append(dngus),
    '인아' :[].append(dlsdk),
}

In [36]:
df = pd.DataFrame(
    data,
    )
df.T

       0     1     2     3
서준    80    98    85   100
우현  None  None  None  None
인아  None  None  None  None

In [40]:
# df2로 복사
df2 = df.T.copy()
df2

       0     1     2     3
서준    80    98    85   100
우현  None  None  None  None
인아  None  None  None  None

In [44]:
#df2의 index가 우현인 1개행을 삭제
df2.drop('우현')

       0     1     2     3
서준    80    98    85   100
인아  None  None  None  None

In [46]:
df2

       0     1     2     3
서준    80    98    85   100
우현  None  None  None  None
인아  None  None  None  None

In [49]:
df2.drop('우현', axis=0, inplace=True)

KeyError: "['우현'] not found in axis"

In [50]:
df2

       0     1     2     3
서준    80    98    85   100
인아  None  None  None  None

In [78]:
df3 = df.T.copy()
df3

       0     1     2     3
서준    80    98    85   100
우현  None  None  None  None
인아  None  None  None  None

In [52]:
# df3 의 index가 우현과 인아인 2개 행을 한번에 삭제

       0     1     2     3
서준    80    98    85   100
우현  None  None  None  None
인아  None  None  None  None

In [53]:

df3.drop('우현'&'인아', axis=0, inplace=True)
df3

TypeError: unsupported operand type(s) for &: 'str' and 'str'

In [60]:
df3.index =='우현'

array([False,  True, False])

In [62]:
df3.index =='우현' & df3.index =='인아'

TypeError: unsupported operand type(s) for &: 'str' and 'Index'

In [64]:
df3.index[1:3,]

Index(['우현', '인아'], dtype='object')

In [65]:
df3.drop(df3.index[1:3,], axis=0, inplace=True)
df3

     0   1   2    3
서준  80  98  85  100

In [72]:
(df.T.index == '우현' & df.T.index == '인아')

TypeError: unsupported operand type(s) for &: 'str' and 'Index'

In [75]:
df.T

       0     1     2     3
서준    80    98    85   100
우현  None  None  None  None
인아  None  None  None  None

In [86]:
df3.drop(['우현','인아'], axis=0, inplace=True)
df3

     0   1   2    3
서준  80  98  85  100

In [88]:
# 열 삭제
df4 = df.T.copy()
df4

       0     1     2     3
서준    80    98    85   100
우현  None  None  None  None
인아  None  None  None  None

In [89]:
# df4 의 열을 삭제

df4.drop(1, axis=1,inplace=True)
df4

       0     2     3
서준    80    85   100
우현  None  None  None
인아  None  None  None

In [95]:
df5 = df.copy()
df5

    Math  Eng  Music   P.E
서준    90   98     85   100
우현    80   89     95    90
인아    70   95    100    90

In [97]:
# df5의 영어와 음악 2개 열 삭제
df5.drop(['Math','Music'],axis=1, inplace=True)
df5

    Eng   P.E
서준   98   100
우현   89    90
인아   95    90

In [98]:
# df6 = df.copy()
# df6.drop(['Math','Music'],axis=1, ['서준','우현'], axis=0, inplace=True)
# df6

    Math  Eng  Music   P.E
서준    90   98     85   100
우현    80   89     95    90
인아    70   95    100    90

In [99]:
df.loc['서준']

Math      90
Eng       98
Music     85
 P.E     100
Name: 서준, dtype: int64

In [100]:
df.iloc[0]# iloc = index location

Math      90
Eng       98
Music     85
 P.E     100
Name: 서준, dtype: int64

In [104]:
df.iloc[1:2]

    Math  Eng  Music   P.E
우현    80   89     95    90

In [105]:
df['Math']

서준    90
우현    80
인아    70
Name: Math, dtype: int64

In [106]:
df.Math

서준    90
우현    80
인아    70
Name: Math, dtype: int64

In [107]:
df.iloc[0:3:2] # 시작:끝:증가치 (2개씩, 짝수증가)

    Math  Eng  Music   P.E
서준    90   98     85   100
인아    70   95    100    90

In [108]:
df.iloc[::-1] # 역순 출력

    Math  Eng  Music   P.E
인아    70   95    100    90
우현    80   89     95    90
서준    90   98     85   100

### 행과 열을 이용한 데이터 선택
1) DataFrame 생성 및 특정 위치 찾기

In [192]:
exam_data = {'수학':[90,80,70], '영어':[98,89,95],
 '음악':[85,95,100], '체육':[100,90,90], '이름': ['서준','우현','인아'] }
exam_data

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90],
 '이름': ['서준', '우현', '인아']}

In [193]:
df = pd.DataFrame(
    exam_data
)
df

   수학  영어   음악   체육  이름
0  90  98   85  100  서준
1  80  89   95   90  우현
2  70  95  100   90  인아

In [113]:
df.index = df.이름
df

    수학  영어   음악   체육  이름
이름
서준  90  98   85  100  서준
우현  80  89   95   90  우현
인아  70  95  100   90  인아

In [196]:
# Create index name
df.set_index(
    '이름',
    inplace=True
)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [131]:
# 서준의 음악, 체육 점수만 출력

df.loc['서준',['영어','수학']]

영어    98
수학    90
Name: 서준, dtype: int64

In [152]:
df.loc['서준','음악':]

음악     85
체육    100
Name: 서준, dtype: int64

In [148]:
df.iloc[0,0:2]

수학    90
영어    98
Name: 서준, dtype: int64

In [150]:
df.iloc[0,0:3:2]

수학    90
음악    85
Name: 서준, dtype: int64

### 데이터 변경하기

In [153]:
df['국어'] = 80
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [213]:
df['국어'] = [80,90,85,90]
df

    수학  영어   음악  체육  국어
이름
서준  90  98  100  90  80
우현  80  89   95  90  90
인아  70  95  100  90  85
영희  70  95  100  90  90

In [185]:
# 철수란 학생의 점수는 10,20,30,40,50 으로 추가하기
#df.index.append={'철수':[1,2,3,4,5]}
df
#????

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  90
인아  70  95  100   90  85

In [197]:
#df.index['철수'] = [1,2,3,4,5]
#df.iloc['철수'] = [1,2,3,4,5]
#df.loc["철수"] = [10,20,30,40,50]
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [199]:
# 영희의 점수는 인아와 동일하다 데이터 추가하기
df.loc['영희'] = df.loc['인아']
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
영희  70  95  100   90

In [204]:
# 서준의 체육점수를 80으로 변경하기
df.loc['서준','체육'] = 80
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90
영희  70  95  100  90

In [207]:
# 서준의 음악과 체육 점수를 50점으로 변경하기
df.loc['서준',['음악','체육']] = 50
df

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90
영희  70  95  100  90

In [209]:
# 서준의 음악점수를 100점 체육점수를 50점으로 한번에 변경하기
df.loc['서준',['음악','체육']] = [100,90]
df

    수학  영어   음악  체육
이름
서준  90  98  100  90
우현  80  89   95  90
인아  70  95  100  90
영희  70  95  100  90

In [214]:
df.T

이름   서준  우현   인아   영희
수학   90  80   70   70
영어   98  89   95   95
음악  100  95  100  100
체육   90  90   90   90
국어   80  90   85   90

In [220]:
df.transpose

<bound method DataFrame.transpose of     수학  영어   음악  체육  국어
이름
서준  90  98  100  90  80
우현  80  89   95  90  90
인아  70  95  100  90  85
영희  70  95  100  90  90>

In [217]:
df.T

이름   서준  우현   인아   영희
수학   90  80   70   70
영어   98  89   95   95
음악  100  95  100  100
체육   90  90   90   90
국어   80  90   85   90

In [223]:
range(1,16)

range(1, 16)

In [224]:
import numpy as np

In [232]:
np.arange(1,16)

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15])

In [251]:
arr1 = np.reshape(np.arange(1,16),(5,3))
df = pd.DataFrame(arr1).T
#df.columns = ['c0','c1','c2','c3','c4']

In [254]:
df.columns = ['c0','c1','c2','c3','c4']
df.index=['r0','r1','r2']
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [241]:
# 강사님 답안
test = {
    'r0' : [1,4,7,10,13],
    'r1' : [2,5,8,11,14],
    'r2' : [3,6,9,12,15],
}
test

{'r0': [1, 4, 7, 10, 13], 'r1': [2, 5, 8, 11, 14], 'r2': [3, 6, 9, 12, 15]}

In [247]:
df = pd.DataFrame(test).T
df.columns = ['c0','c1','c2','c3','c4']
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [255]:
# index 재설정
new_index = ['r0','r1','r2','r3','r4']
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [256]:
# index 재설정 / # Nan 보기 싫으면 0으로 넣기
new_index = ['r0','r1','r2','r3','r4']
ndf = df.reindex(new_index, fill_value=0)
ndf

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [257]:
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [259]:
# 인덱스 정렬하기
df.sort_index
#역순
df.sort_index(ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [261]:
# c1을 기준으로 내림차순 정렬 후 바로 적용하기
df.sort_values(by='c1', ascending=False, inplace=True )
df

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

---
### DataFrame 연산

In [263]:
#!pip install seaborn

Collecting seaborn
  Downloading seaborn-0.12.2-py3-none-any.whl (293 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 293.3/293.3 kB 9.7 MB/s eta 0:00:00
Requirement already satisfied: numpy!=1.24.0,>=1.17 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from seaborn) (1.23.2)
Requirement already satisfied: matplotlib!=3.6.1,>=3.1 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from seaborn) (3.6.3)
Requirement already satisfied: pandas>=0.25 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from seaborn) (1.5.3)
Requirement already satisfied: pillow>=6.2.0 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (9.4.0)
Requirement already satisfied: fonttools>=4.22.0 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (4.38.0)
Requirement already satisfied: python-dateutil>=2.7 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (2.8.2)
Requirement already satisfied: pyparsing>=2.2.1 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (3.0.9)
Requirement already satisfied: contourpy>=1.0.1 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.0.7)
Requirement already satisfied: packaging>=20.0 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (23.0)
Requirement already satisfied: cycler>=0.10 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (0.11.0)
Requirement already satisfied: kiwisolver>=1.0.1 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.4.4)
Requirement already satisfied: pytz>=2020.1 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from pandas>=0.25->seaborn) (2022.7.1)
Requirement already satisfied: six>=1.5 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.1->seaborn) (1.16.0)
Installing collected packages: seaborn
Successfully installed seaborn-0.12.2

In [264]:
import seaborn as sns

In [268]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [286]:
# titanic 에서 age와 fare부분만 발췌하여 df 라는 dataframe 만들기
df = pd.DataFrame(titanic[['age','fare']])
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [302]:
# 모든 컬럼을 10씩 증가하여 addition이라는 dataframe 생성하기
#addition = df +10
addition = df.add(10)

In [303]:
addition

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [305]:
# addition 과 df의 차이를 구하여 subtraction 이라는 dataframe 만들기
subtraction = addition - df

In [306]:
subtraction

      age  fare
0    10.0  10.0
1    10.0  10.0
2    10.0  10.0
3    10.0  10.0
4    10.0  10.0
..    ...   ...
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

[891 rows x 2 columns]